app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)

    respond_to do |format|
      if @cat.save
---
INSERT INTO "cats" ("category_id", "cat_name", "article", "time", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @cat.update(cat_params)
---
UPDATE "cats" SET "article" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["article", "今日はりーりあさんが一晩中ベッドに入っていて、すごく寝づらかった。\r\nでもあったかいし、かわいいから良し！\r\n"], ["updated_at", "2022-03-23 09:12:31.533153"], ["id", 1]]

    def set_cat
      @cat = Cat.find(params[:id])
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]